Revit 2027 API
Category.SetLineWeight Method
Sets the line weight for the given graphics style type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLineWeight(
	int lineWeight,
	GraphicsStyleType graphicsStyleType
)
Public Sub SetLineWeight (
	lineWeight As Integer,
	graphicsStyleType As GraphicsStyleType
)
public:
void SetLineWeight(
	int lineWeight,
	GraphicsStyleType graphicsStyleType
)
member SetLineWeight :
        lineWeight : int *
        graphicsStyleType : GraphicsStyleType -> unit
Parameters
lineWeight Int32
graphicsStyleType GraphicsStyleType
The type of graphics style.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the input argument-"lineWeight" or "graphicsStyleType"-is out of range.
See Also
Reference
Category Class
Autodesk.Revit.DB Namespace